In [1]:
from twitter_fetcher import TwitterEntityGroup

In [2]:
group = TwitterEntityGroup('../db/reviewed/Parlamentarier.csv')

In [3]:
group.df[['SM_Twitter_id']].head()

        SM_Twitter_id
0                 NaN
1          1074444199
2  826402742893760512
3  791978053379432448
4           262062333

In [4]:
group.check_accounts(output='../db/changed_twitter_accounts.csv')

/Users/muench/HBI/Projects/DBoeSAuto/scraper/twitter_fetcher.py:137: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  old['SM_Twitter_user'] = old['SM_Twitter_user'].str.lower()

           SM_Twitter_id SM_Twitter_user old/new
0               16325209           solms     new
1               16325209       tinosorge     old
2               16808099    ralf_stegner     new
3               16808099        aminajxx     old
4               17462171  florian_toncar     new
..                   ...             ...     ...
277  1153326441628651521       delarabur     old
278  1153326441628651521  buchheitmarkus     new
279  1173704882269896704   fabianmehring     old
280  1174999375044591616     daviderkalp     old
281  1204005307640434688      tabberturs     old

[282 rows x 3 columns]